export const privateMessages = {
  WELCOME: {
    NEW: `🎅 Привет! Я бот Тайный Санта!
Я помогу организовать праздничный обмен подарками в вашей группе.

Чтобы начать, добавьте меня в групповой чат, и я помогу настроить игру.`,
    REGISTRATION_MEMBER: `🎅 Привет! Я бот Тайный Санта!
Я помогу организовать праздничный обмен подарками в вашей группе.

Чтобы начать, добавьте меня в групповой чат, и я помогу настроить игру.`,
    EXISTING_MEMBER: `🎅 С возвращением!
Вы уже учавствуете в Тайном Санте, выберите ваше дальнейшее действие`,
  },
  REGISTRATION_REQUIRED:
    '🎯 Для заполнения пожеланий нужно зарегистрироваться, введите команду /start',
  WISHES_PROMPT: `🎁 *Настройка пожеланий для подарка*

✍️ Пожалуйста, напишите ваши пожелания:
• что вам нравится
• какие у вас хобби
• что бы вы хотели получить

💫 Ваши пожелания помогут Тайному Санте выбрать идеальный подарок и сделать праздник действительно волшебным!`,
  TEXT_REQUIRED: '📝 Пожалуйста, введите ваши пожелания текстом',
  USER_NOT_FOUND: '❌ Не удалось получить информацию о пользователе.',
  GROUP_NOT_FOUND: 'Такой группы не существует или произошла ошибка!',
  UPDATE_ERROR:
    '❌ Произошла ошибка при обновлении пожеланий. Пожалуйста, попробуйте позже.',
  UPDATE_SUCCESS: '✅ Ваши пожелания успешно обновлены!',
};
